fukangwei/Embedded_Application/STM32/DMA/HARDWARE/KEY/key.c
#include "stm32f10x.h"
#include "key.h"
#include "sys.h"
#include "delay.h"

void KEY_Init ( void ) {
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_APB2PeriphClockCmd ( RCC_APB2Periph_GPIOA, ENABLE );
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init ( GPIOA, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_Init ( GPIOA, &GPIO_InitStructure );
}

u8 KEY_Scan ( void ) {
    static u8 key_up = 1;
    GPIO_PinRemapConfig ( GPIO_Remap_SWJ_Disable, ENABLE );

    if ( key_up && ( KEY0 == 0 || KEY1 == 0 || KEY2 == 1 ) ) {
        delay_ms ( 10 );
        key_up = 0;

        if ( KEY0 == 0 ) {
            GPIO_PinRemapConfig ( GPIO_Remap_SWJ_JTAGDisable, ENABLE );
            return 1;
        } else if ( KEY1 == 0 ) {
            GPIO_PinRemapConfig ( GPIO_Remap_SWJ_JTAGDisable, ENABLE );
            return 2;
        } else if ( KEY2 == 1 ) {
            GPIO_PinRemapConfig ( GPIO_Remap_SWJ_JTAGDisable, ENABLE );
            return 3;
        }
    } else if ( KEY0 == 1 && KEY1 == 1 && KEY2 == 0 ) {
        key_up = 1;
    }

    GPIO_PinRemapConfig ( GPIO_Remap_SWJ_JTAGDisable, ENABLE );
    return 0;
}